app/controllers/categorias_controller.rb

SELECT * FROM "categorias"
---
  def index
    @categorias = Categoria.all

SELECT * FROM "categorias" WHERE ("categorias"."id" = 1)
---
  def show
    @categoria = Categoria.find(params[:id])