app/controllers/depositos_controller.rb

SELECT * FROM "depositos"
---
  def index
    @depositos = Deposito.paginate(:page => params[:page],:per_page => 6,:order => "nombre")

SELECT * FROM "depositos" WHERE ("depositos"."id" = 1)
---
  def show
    @deposito = Deposito.find(params[:id])

INSERT INTO "depositos" ("nombre", "created_at", "updated_at") VALUES('Central', '2013-04-05 23:51:38.749000', '2013-04-05 23:51:38.749000') RETURNING "id"
---
  def create
    @deposito = Deposito.new(params[:deposito])

    respond_to do |format|
      if @deposito.save