app/controllers/marcas_controller.rb

   def index
    if params[:txtbuscar].blank?
       @marcas = Marca.paginate(:page => params[:page],:per_page => 6,:order => "nombre")
---
SELECT * FROM "marcas"

  def show
    @marca = Marca.find(params[:id])
---
SELECT * FROM "marcas" WHERE ("marcas"."id" = 2)

  def edit
    @marca = Marca.find(params[:id])
---
SELECT * FROM "marcas" WHERE ("marcas"."id" = 1)

  def create
    @marca = Marca.new(params[:marca])

    respond_to do |format|
      if @marca.save
---
INSERT INTO "marcas" ("nombre", "created_at", "updated_at") VALUES('se', '2013-04-12 13:20:52.242000', '2013-04-12 13:20:52.242000') RETURNING "id"

  def update
    @marca = Marca.find(params[:id])

    respond_to do |format|
      if @marca.update_attributes(params[:marca])
---
SELECT * FROM "marcas" WHERE ("marcas"."id" = 1)
UPDATE "marcas" SET "nombre" = 'Macao', "updated_at" = '2013-04-12 13:23:00.118000' WHERE "id" = 1