app/controllers/marcas_rubros_controller.rb

  def index
    @marcas_rubros = MarcasRubro.all
---
SELECT * FROM "marcas_rubros"

  def show
    @marcas_rubro = MarcasRubro.find(params[:id])
---
SELECT * FROM "marcas_rubros" WHERE ("marcas_rubros"."id" = 1)

  def create
    @marcas_rubro = MarcasRubro.new(params[:marcas_rubro])

    respond_to do |format|
      if @marcas_rubro.save
---
INSERT INTO "marcas_rubros" ("marca_id", "rubro_id", "created_at", "updated_at") VALUES(1, 1, '2013-04-13 13:33:59.285000', '2013-04-13 13:33:59.285000') RETURNING "id"