app/controllers/menus_controller.rb

SELECT * FROM "menus"
---
  def index
    @menus = Menu.all

SELECT * FROM "menus" WHERE ("menus"."id" = 1)
---
  def show
    @menu = Menu.find(params[:id])

INSERT INTO "menus" ("nombre", "parent_id", "url", "tooltip", "ayuda", "created_at", "updated_at", "posicion_pila") VALUES('Ventas', 0, '', '', '', '2013-03-21 13:56:14.496000', '2013-03-21 13:56:14.496000', 0) RETURNING "id"
---
  def create
    @menu = Menu.new(params[:menu])

    respond_to do |format|
      if @menu.save