app/controllers/monedas_controller.rb

SELECT * FROM "monedas"
---
  def index
    @monedas = Moneda.all