app/controllers/productos_controller.rb

  def index
    filtros =  " "
    unless params[:rubro_id].blank?
      filtros += " AND rubro_id = #{params[:rubro_id]}"
    end

    unless params[:seccion_id].blank?
      filtros += " AND seccion_id = #{params[:seccion_id]}"
    end

    unless params[:categoria_id].blank?
      filtros += " AND categoria_id = #{params[:categoria_id]}"
    end

    unless params[:marca_id].blank?
      filtros += " AND marca_id = #{params[:marca_id]}"
    end

    unless params[:proveedor_id].blank?
      filtros += " AND marca_id = #{params[:proveedor_id]}"
    end


      if params[:txtbuscar].blank? && filtros == " "
         @productos = Producto.paginate(:page => params[:page],:per_page => 24,:order => "nombre")
---
SELECT * FROM "productos"

  def show
    @producto = Producto.find(params[:id])
---
SELECT * FROM "productos" WHERE ("productos"."id" = 0)