app/controllers/provincias_controller.rb

  def index
    @provincias = Provincia.all
---
SELECT * FROM "provincias"

  def show
    @provincia = Provincia.find(params[:id])
---
SELECT * FROM "provincias" WHERE ("provincias"."id" = 1)

  def create
    @provincia = Provincia.new(params[:provincia])

    respond_to do |format|
      if @provincia.save
---
INSERT INTO "provincias" ("nombre", "created_at", "updated_at") VALUES('Corrientes', '2013-05-20 13:45:13.966000', '2013-05-20 13:45:13.966000') RETURNING "id"