app/controllers/roles_users_controller.rb

SELECT * FROM "roles_users"
---
  def index
    @roles_users = RolesUser.all

SELECT * FROM "roles_users" WHERE ("roles_users"."id" = 1)
---
  def show
    @roles_user = RolesUser.find(params[:id])

INSERT INTO "roles_users" ("rol_id", "user_id", "created_at", "updated_at") VALUES(1, 1, '2013-03-21 14:31:10.320000', '2013-03-21 14:31:10.320000') RETURNING "id"
---
  def create
    @roles_user = RolesUser.new(params[:roles_user])

    respond_to do |format|
      if @roles_user.save