app/controllers/rubros_controller.rb

  def index
    @rubros = Rubro.all
---
SELECT * FROM "rubros"

  def show
    @rubro = Rubro.find(params[:id])
---
SELECT * FROM "rubros" WHERE ("rubros"."id" = 1)

  def create
    @rubro = Rubro.new(params[:rubro])

    respond_to do |format|
      if @rubro.save
---
INSERT INTO "rubros" ("nombre", "created_at", "updated_at") VALUES('Herrajes', '2013-04-13 13:32:14.978000', '2013-04-13 13:32:14.978000') RETURNING "id"