app/controllers/users_controller.rb

   def index
    @usuario = User.new
    if params[:txtbuscar].blank?
       @usuarios = User.paginate(:page => params[:page],:order => 'name')
---
SELECT * FROM "users" WHERE (lower(name) like lower('%bro%')) ORDER BY name LIMIT 30 OFFSET 0

  def create
    #logout_keeping_session!
    params[:usuario][:password]='123'
    params[:usuario][:password_confirmation]='123'
    @usuario = User.new(params[:usuario])
    success = @usuario && @usuario.save
---
INSERT INTO "users" ("login", "name", "email", "crypted_password", "salt", "created_at", "updated_at", "remember_token", "remember_token_expires_at", "activation_code", "activated_at") VALUES('broger', '', 'gerardogbrollo@gmail.com', '8c6e97fa050512420daf628cc4443eb8d837495e', '335a1c4b5f2ed4c39c225d9bed85d54c8effa17b', '2013-03-14 14:16:02.374000', '2013-03-14 14:16:02.374000', NULL, NULL, 'f7423b0e9a441cd8dc138eaa1823845766d65103', NULL) RETURNING "id"

   def edit
    @usuario = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

    def update
    @usuario = User.find(params[:id])
                  if @usuario.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "name" = 'Brollo Ger dddd', "updated_at" = '2013-05-30 19:25:11.792000' WHERE "id" = 1